/*************************************************************************
	> File Name: const.cpp
	> Author: 
	> Mail: 
	> Created Time: 日  9/11 14:43:40 2016
 ************************************************************************/

#include <iostream>
using namespace std;

int x = 10;

// 常量不可修改
// 大范围的值可以设定小范围变量，小范围的值不可以设定大范围的变量
// 引用：可以理解为，将当前变量或常量的地址映射到其他变量的地址上
//       虽然常量继承了引用变量的值，但是常量仍然不可更改，
//       但是可以通过修改该变量的值，从而实现修改常量值的实现

const int &MYNUM = x;

int main()
{
    cout << "Const num:" << MYNUM << endl;
    int b = 12;
    x = b;
    cout << "Const num:" << MYNUM << endl;

    return 0;
}
